import React from "react";
import Header from '../../../components/nav/Header';
import { Collapse } from 'antd';
import { CaretRightOutlined } from '@ant-design/icons';

const { Panel } = Collapse;

const Privacy = () => {
    return (
        <>
            <Header />
            <div className='container'>
                <h1 className='text-right'>خصوصية الموقع</h1>
                <br />
                <Collapse
                    bordered={false}
                    expandIcon={({ isActive }) => <CaretRightOutlined rotate={isActive ? 90 : 0} />}
                    className="site-collapse-custom-collapse"
                >
                    <Panel header="عنوان البريد الالكتروني الخاص بك" key="1" className="site-collapse-custom-panel text-right">
                        <p>
                            لغرض تسجيل حساب، نحن نطلب منك تزويدنا بعنوان بريدك الالكتروني واي معلومات أخرى مطلوبة للاتصال بك عبر
                            الانترنت وعبر الهاتف. نحن نستخدم عنوان بريدك الالكتروني
                            ومعلومات الاتصال الاخرى التي تقوم بتقديمها الينا للتأكيد
                            على طلبك وابلاغك في حالة وجود مشكلة في الطلب ، لذلك لا يمكن لشخص التسجيل بدون عنوان بريد الكتروني. وفي
                            حالة تسجيل عنوان البريد الإلكتروني ، يمكنك الدخول اليه فيما بعد وتحديثه وتعديله وحذف أي بيانات غير دقيقة
                            عن طريق الدخول الى حسابك من خلال رابط معلومات "حسابي" في الصفحة الرئيسية للمستخدم.
                            نحن نبلغ جزء من معلومات الاتصال بك (الاسم واسم العائلة وعنوان توصيل الطلب ورقم الهاتف)
                            الى المطعم العضو الذي قمت بتقديم الطلب اليه. كما أننا نستخدم هذه المعلومات
                            ايضا لتسهيل تحسين استخدامك للموقع والتواصل معك ولإستخدامات داخلية والالتزام بأي متطلبات قانونية.
                            ويجوز الكشف عن هذه المعلومات الى موظفينا والى جميع المشاركين في تنفيذ طلبك او لتحليل
                            ودعم استخدامك للموقع. اننا لا نبيع ولن نقوم بالكشف عن معلومات الاتصال الشخصية الخاصة بك الى الغير بخلاف
                            ما هو محدد في سياسة الخصوصية الماثلة بدون تصريح منك وما لم يحق لنا او نكون ملزمين بالقيام بذلك
                            (على سبيل المثال في حالة ضرورة قيامنا بذلك بموجب امر من المحكمة او لاغراض منع الاحتيال او أي جريمة اخرى).
                    </p>
                    </Panel>
                    <br />
                    <Panel header="معلومات تقديم الطلب" key="2" className="site-collapse-custom-panel text-right">
                        <p>
                            المعلومات الشخصية المطلوبة اثناء تنفيذ الطلب تشمل الاسم والعنوان ورقم الهاتف وعنوان البريد الالكتروني والمعلومات الاخرى المشابهة المستخدمة للتعريف عنك وانجاز الطلب.

                            المعلومات الشخصية التي يتم جمعها في موقعنا سوف يتم مشاركتها مع المطعم عند تنفيذ طلبك. ان لدينا اتفاقية مع كافة المطاعم الاعضاء
                            التي تقيد التصريح عن او المعالجة الاضافية للمعلومات المقدمة لهم من جانبنا. ان معلوماتك الشخصية سوف يتم استخدامها لابلاغك بوضع طلبك.
                            ولن يتم مشاركة المعلومات الشخصية مع أي من شركاء العمل لدينا او الشركات الزميلة بدون تصريح منك فسوف يتم
                            التعامل معها بسرية ولن يتم الكشف عنها الى الاطراف الخارجية، ما لم نكون مضطرين لذلك بموجب التشريعات المعمول بها.
                            اننا نقوم فقط بارسال رسائل الكترونية خاصة بالتسويق الى اولئك الاشخاص الذين قاموا تحديدا بطلب استلام هذه المعلومات.
                    </p>
                    </Panel >
                    <br />
                    <Panel header="قد نقوم باستخدام شركات الاعلان لتقديم اعلانات لنا" key="3" className="site-collapse-custom-panel text-right">
                        <p>
                            قد تقوم هذه الشركات باستخدام الكوكيز وبطاقات الاعمال لقياس فعالية الاعلان. كما قد تقوم ايضا باستخدام هذه التكنولوجيا لتقديم محتوى الاعلان المتخصص او ذو الصلة لك و/أو تقديم التوصيات اليك لموقعنا أو الموقع الخاص بهم. واي معلومات تقوم الأطراف الأخرى بجمعها عن طريق الكوكيز وبطاقات الاعمال مجهولة تماما ولا تحتوي على أي معلومات اتصال شخصي.
                        </p>
                    </Panel >
                    <br />
                    <Panel header="التسويق" key="4" className="site-collapse-custom-panel text-right">
                        <p>
                            نحن لا نقوم ببيع او تأجير معلوماتك الشخصية الى الغير لاغراض التسويق الخاصة بهم بدون موافقة صريحة منك.
                            وقد نقوم بجمع معلوماتك مع معلومات نقوم بجمعها من الشركات الاخرى واستخدامها لتحسين وتخصيص خدماتنا ومحتوياتنا واعلاناتنا. في حالة عدم رغبتك في استلام مراسلات التسويق منا عن طريق البريد الالكتروني او المشاركة في برامج تخصيص الاعلانات لدينا، ما عليك الا القيام ببساطة بابلاغنا باختيارك بالبريد الالكتروني او الدخول الى حسابك على الموقع وتغيير الوضعيات ذات الصلة من رابط "حسابي" في الصفحة الرئيسية للمستخدم.
                        </p>
                    </Panel >
                </Collapse>
            </div>
        </>
    );
};

export default Privacy;